IDEA Open Model
Stirrup.ShearCheck Property
Compatible with IDEA StatiCa v 10.1
 Status of shear check, not possible for detailing stirrup
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public bool ShearCheck { get; set; }
Public Property ShearCheck As Boolean
	Get
	Set
public:
property bool ShearCheck {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
Stirrup Class
IdeaRS.OpenModel.CrossSection Namespace